package com.example.uiwidgettest.thelight.tab;

import java.util.List;

/**
 * Created by 40774 on 2017/9/29.
 */

public class initArticle {
    public void initLSF(List<MyPlan> myPlen)
    {
        myPlen.clear();//每初始化一个碎片清空
        MyPlan[] myPlay=new MyPlan[10];//循环的个数
        myPlay[0]=new MyPlan();
        myPlay[0].setMyplan("\n" +"洛神赋\b\b三国\b\b曹植\n"+
                "\n    黄初三年，余朝京师，还济洛川。古人有言，斯水之神，名曰宓妃。" +
                "感宋玉对楚王神女之事，遂作斯赋。\n");
        myPlen.add(myPlay[0]);
        myPlay[1]=new MyPlan();
        myPlay[1].setMyplan(
                "    其辞曰：" +
                        "余从京域，言归东藩。背伊阙，越轘辕，经通谷，陵景山。" +
                        "日既西倾，车殆马烦。尔乃税驾乎蘅皋，秣驷乎芝田，" +
                        "容与乎阳林，流眄乎洛川。于是精移神骇，忽焉思散。" +
                        "俯则末察，仰以殊观，睹一丽人，于岩之畔。乃援御者而告之曰：" +
                        "“尔有觌于彼者乎？彼何人斯？若此之艳也！”御者对曰：“臣闻河洛之神，名曰宓妃" +
                        "。然则君王所见，无乃日乎？其状若何？臣愿闻之。”\n"
        );
        myPlen.add(myPlay[1]);
        myPlay[2]=new MyPlan();
        myPlay[2].setMyplan(
                "    余告之曰：“其形也，翩若惊鸿，婉若游龙。荣曜秋菊，华茂春松。" +
                        "仿佛兮若轻云之蔽月，飘摇兮若流风之回雪。远而望之，皎若太阳升朝霞；" +
                        "迫而察之，灼若芙蕖出渌波。秾纤得衷，修短合度。肩若削成，腰如约素。" +
                        "延颈秀项，皓质呈露。芳泽无加，铅华弗御。云髻峨峨，修眉联娟。" +
                        "丹唇外朗，皓齿内鲜，明眸善睐，靥辅承权。瑰姿艳逸，仪静体闲。" +
                        "柔情绰态，媚于语言。奇服旷世，骨像应图。披罗衣之璀粲兮，珥瑶碧之华琚" +
                        "。戴金翠之首饰，缀明珠以耀躯。践远游之文履，曳雾绡之轻裾。微幽兰之芳蔼兮，" +
                        "步踟蹰于山隅。”\n"
        );
        myPlen.add(myPlay[2]);
        myPlay[3]=new MyPlan();
        myPlay[3].setMyplan(
                "    于是忽焉纵体，以遨以嬉。左倚采旄，右荫桂旗。" +
                        "壤皓腕于神浒兮，采湍濑之玄芝。" +
                        "余情悦其淑美兮，心振荡而不怡。无良媒以接欢兮，托微波而通辞。" +
                        "愿诚素之先达兮，解玉佩以要之。嗟佳人之信修，羌习礼而明诗。" +
                        "抗琼［王弟］以和予兮，指潜渊而为期。执眷眷之款实兮，惧斯灵之我欺。"
                        + "感交甫之弃言兮，怅犹豫而狐疑。收和颜而静志兮，申礼防以自持。\n");

        myPlen.add(myPlay[3]);
        myPlay[4]=new MyPlan();
        myPlay[4].setMyplan(
                "    于是洛灵感焉，徙倚彷徨，神光离合，乍阴乍阳。" +
                        "竦轻躯以鹤立，若将飞而未翔。践椒涂之郁烈，步蘅薄而流芳。" +
                        "超长吟以永慕兮，声哀厉而弥长。\n"
        );

        myPlen.add(myPlay[4]);
        myPlay[5]=new MyPlan();
        myPlay[5].setMyplan(
                "    尔乃众灵杂遢，命俦啸侣，或戏清流，或翔神渚，或采明珠，或拾翠羽。" +
                        "从南湘之二妃，携汉滨之游女。叹匏瓜之无匹兮，咏牵牛之独处。扬轻袿之猗靡兮，翳修袖以延伫。" +
                        "体迅飞凫，飘忽若神，凌波微步，罗袜生尘。" +
                        "动无常则，若危若安。进止难期，若往若还。转眄流精，光润玉颜。含辞未吐，气若幽兰。华容婀娜，令我忘餐。\n"
        );

        myPlen.add(myPlay[5]);
        myPlay[6]=new MyPlan();
        myPlay[6].setMyplan(
                "    于是屏翳收风，川后静波。冯夷鸣鼓，女娲清歌。腾文鱼以警乘，鸣玉鸾以偕逝。六龙俨其齐首，载云车之容裔，" +
                        "鲸鲵踊而夹毂，水禽翔而为卫。\n"
        );
        myPlen.add(myPlay[6]);
        myPlay[7]=new MyPlan();
        myPlay[7].setMyplan(
                "    于是越北沚。过南冈，纡素领，回清阳，动朱唇以徐言，" +
                        "陈交接之大纲。恨人神之道殊兮，怨盛年之莫当。抗罗袂以掩涕兮，" +
                        "泪流襟之浪浪。悼良会之永绝兮。哀一逝而异乡。无微情以效爱兮，献江南之明"
                        + "。虽潜处于太阳，长寄心于君王。忽不悟其所舍，怅神宵而蔽光。\n"
        );
        myPlen.add(myPlay[7]);
        myPlay[8]=new MyPlan();
        myPlay[8].setMyplan(
                "    于是背下陵高，足往神留，遗情想像，顾望怀愁。" +
                        "冀灵体之复形，御轻舟而上溯。浮长川而忘返，思绵绵督。" +
                        "夜耿耿而不寐，沾繁霜而至曙。命仆夫而就驾，吾将归乎东路。揽騑辔以抗策，怅盘桓而不能去。"
        );
        myPlen.add(myPlay[8]);
    }
    public void initCSB(List<MyPlan> myPlen)
    {
        myPlen.clear();//每初始化一个碎片清空
        MyPlan[] myPlay=new MyPlan[10];//循环的个数
        myPlay[0]=new MyPlan();
        myPlay[0].setMyplan("\n" +"出师表\b\b三国\b\b诸葛亮\n"+
                "\n\b\b\b\b先帝创业未半而中道崩殂，今天下三分，益州疲弊，此诚危急存亡之秋也" +
                "。然侍卫之臣不懈于内，忠志之士忘身于外者，盖追先帝之殊遇，欲报之于陛下也。" +
                "诚宜开张圣听，以光先帝遗德，恢弘志士之气，不宜妄自菲薄，引喻失义，以塞忠谏之路也。\n"
                );

        myPlen.add(myPlay[0]);
        myPlay[1]=new MyPlan();
        myPlay[1].setMyplan(
                "\b\b\b\b宫中府中，俱为一体，陟罚臧否，不宜异同。" +
                        "若有作奸犯科及为忠善者，宜付有司论其刑赏，以昭陛下平明之理，不宜偏私，使内外异法也。\n"
        );

        myPlen.add(myPlay[1]);
        myPlay[2]=new MyPlan();
        myPlay[2].setMyplan(
                "\b\b\b\b侍中、侍郎郭攸之、费祎、董允等，此皆良实，志虑忠纯，是以先帝简拔以遗陛下" +
                        "。愚以为宫中之事，事无大小，悉以咨之，然后施行，必得裨补阙漏，有所广益。\n"
        );
        myPlen.add(myPlay[2]);
        myPlay[3]=new MyPlan();
        myPlay[3].setMyplan(
                "\b\b\b\b将军向宠，性行淑均，晓畅军事，试用之于昔日，先帝称之曰能，是以众议举宠为督。" +
                        "愚以为营中之事，悉以咨之，必能使行阵和睦，优劣得所。\n" );

        myPlen.add(myPlay[3]);
        myPlay[4]=new MyPlan();
        myPlay[4].setMyplan(
                "\b\b\b\b亲贤臣，远小人，此先汉所以兴隆也；亲小人，远贤臣，此后汉所以倾颓也。" +
                        "先帝在时，每与臣论此事，未尝不叹息痛恨于桓、灵也。" +
                        "侍中、尚书、长史、参军，此悉贞良死节之臣，愿陛下亲之信之，则汉室之隆，可计日而待也。\n"
        );

        myPlen.add(myPlay[4]);
        myPlay[5]=new MyPlan();
        myPlay[5].setMyplan(
                "\b\b\b\b臣本布衣，躬耕于南阳，苟全性命于乱世，不求闻达于诸侯。" +
                        "先帝不以臣卑鄙，猥自枉屈，三顾臣于草庐之中，咨臣以当世之事，由是感激，遂许先帝以驱驰" +
                        "。后值倾覆，受任于败军之际，奉命于危难之间，尔来二十有一年矣。\n"
        );
        myPlen.add(myPlay[5]);
        myPlay[6]=new MyPlan();
        myPlay[6].setMyplan(
                "\b\b\b\b先帝知臣谨慎，故临崩寄臣以大事也。" +
                        "受命以来，夙夜忧叹，恐付托不效，以伤先帝之明，故五月渡泸，深入不毛。" +
                        "今南方已定，甲兵已足，当奖率三军，北定中原，庶竭驽钝，攘除奸凶，兴复汉室，还于旧都。" +
                        "此臣所以报先帝而忠陛下之职分也。至于斟酌损益，进尽忠言，则攸之、祎、允之任也。\n"
        );
        myPlen.add(myPlay[6]);
        myPlay[7]=new MyPlan();
        myPlay[7].setMyplan("\b\b\b\b愿陛下托臣以讨贼兴复之效，不效，则治臣之罪，以告先帝之灵。若无兴德之言，" +
                "则责攸之、祎、允等之慢，以彰其咎；陛下亦宜自谋，以咨诹善道，察纳雅言，深追先帝遗诏，" +
                "臣不胜受恩感激。\n"
        );
        myPlen.add(myPlay[7]);
        myPlay[8]=new MyPlan();
        myPlay[8].setMyplan( "\b\b\b\b今当远离，临表涕零，不知所言。\n"
        );
        myPlen.add(myPlay[8]);
    }
    public void initTWGX(List<MyPlan> myPlen)
    {
        myPlen.clear();//每初始化一个碎片清空
        MyPlan[] myPlay=new MyPlan[10];//循环的个数
        myPlay[0]=new MyPlan();
        myPlay[0].setMyplan("\n" +"滕王阁序\b\b初唐\b\b王勃\n\n\b\b\b\b"+
                "豫章故郡，洪都新府。星分翼轸，地接衡庐。" +
                "襟三江而带五湖，控蛮荆而引瓯越。物华天宝，龙光射牛斗之墟；" +
                "人杰地灵，徐孺下陈蕃之榻。雄州雾列，俊采星驰。" +
                "台隍枕夷夏之交，宾主尽东南之美。都督阎公之雅望，棨戟遥临；宇文新州之懿范，襜帷暂驻。" +
                "十旬休假，胜友如云；千里逢迎，高朋满座。腾蛟起凤，孟学士之词宗；紫电青霜，王将军之武库。" +
                "家君作宰，路出名区；童子何知，躬逢胜饯。\n"
        );

        myPlen.add(myPlay[0]);
        myPlay[1]=new MyPlan();
        myPlay[1].setMyplan(
                "\b\b\b\b时维九月，序属三秋。潦水尽而寒潭清，烟光凝而暮山紫。" +
                        "俨骖騑于上路，访风景于崇阿；临帝子之长洲，得天人之旧馆。" +
                        "层峦耸翠，上出重霄；飞阁流丹，下临无地。" +
                        "鹤汀凫渚，穷岛屿之萦回；桂殿兰宫，即冈峦之体势。\n"
        );

        myPlen.add(myPlay[1]);
        myPlay[2]=new MyPlan();
        myPlay[2].setMyplan(
                "\b\b\b\b披绣闼，俯雕甍，山原旷其盈视，川泽纡其骇瞩。闾阎扑地，钟鸣鼎食之家；" +
                        "舸舰迷津，青雀黄龙之舳。云销雨霁，彩彻区明。" +
                        "落霞与孤鹜齐飞，秋水共长天一色。" +
                        "渔舟唱晚，响穷彭蠡之滨；雁阵惊寒，声断衡阳之浦。\n"
        );
        myPlen.add(myPlay[2]);
        myPlay[3]=new MyPlan();
        myPlay[3].setMyplan(
                "\b\b\b\b遥襟甫畅，逸兴遄飞。爽籁发而清风生，纤歌凝而白云遏。" +
                        "睢园绿竹，气凌彭泽之樽；邺水朱华，光照临川之笔。" +
                        "四美具，二难并。穷睇眄于中天，极娱游于暇日。" +
                        "天高地迥，觉宇宙之无穷；兴尽悲来，识盈虚之有数。" +
                        "望长安于日下，目吴会于云间。地势极而南溟深，天柱高而北辰远。" +
                        "关山难越，谁悲失路之人？萍水相逢，尽是他乡之客。怀帝阍而不见，奉宣室以何年？\n" );

        myPlen.add(myPlay[3]);
        myPlay[4]=new MyPlan();
        myPlay[4].setMyplan(
                "\b\b\b\b嗟乎！时运不齐，命途多舛。冯唐易老，李广难封。" +
                        "屈贾谊于长沙，非无圣主；窜梁鸿于海曲，岂乏明时？" +
                        "所赖君子见机，达人知命。老当益壮，宁移白首之心？" +
                        "穷且益坚，不坠青云之志。酌贪泉而觉爽，处涸辙以犹欢。" +
                        "北海虽赊，扶摇可接；东隅已逝，桑榆非晚。孟尝高洁，空余报国之情；阮籍猖狂，岂效穷途之哭！\n"
        );

        myPlen.add(myPlay[4]);
        myPlay[5]=new MyPlan();
        myPlay[5].setMyplan(
                "\b\b\b\b勃，三尺微命，一介书生。无路请缨，等终军之弱冠；" +
                        "有怀投笔，慕宗悫之长风。舍簪笏于百龄，奉晨昏于万里。" +
                        "非谢家之宝树，接孟氏之芳邻。他日趋庭，叨陪鲤对；" +
                        "今兹捧袂，喜托龙门。杨意不逢，抚凌云而自惜；钟期既遇，奏流水以何惭？\n"
        );
        myPlen.add(myPlay[5]);
        myPlay[6]=new MyPlan();
        myPlay[6].setMyplan(
                "\b\b\b\b呜乎！胜地不常，盛筵难再；兰亭已矣，梓泽丘墟。" +
                        "临别赠言，幸承恩于伟饯；登高作赋，是所望于群公。" +
                        "敢竭鄙怀，恭疏短引；一言均赋，四韵俱成。请洒潘江，各倾陆海云尔：\n" +
                        "滕王高阁临江渚，佩玉鸣鸾罢歌舞。\n" +
                        "画栋朝飞南浦云，珠帘暮卷西山雨。\n" +
                        "闲云潭影日悠悠，物换星移几度秋。\n" +
                        "阁中帝子今何在？槛外长江空自流。\n");
        myPlen.add(myPlay[6]);
    }
    public void initCQB(List<MyPlan> myPlen)
    {
        myPlen.clear();//每初始化一个碎片清空
        MyPlan[] myPlay=new MyPlan[10];//循环的个数
        myPlay[0]=new MyPlan();
        myPlay[0].setMyplan("\n" +"陈情表\b\b蜀末晋初\b\b李密\n\n\b\b\b\b"+
                "臣密言：臣以险衅，夙遭闵凶。生孩六月，慈父见背；" +
                "行年四岁，舅夺母志。祖母刘悯臣孤弱，躬亲抚养。臣少多疾病，" +
                "九岁不行，零丁孤苦，至于成立。既无叔伯，终鲜兄弟，门衰祚薄，晚有儿息。" +
                "外无期功强近之亲，内无应门五尺之僮，茕茕孑立，形影相吊。" +
                "而刘夙婴疾病，常在床蓐，臣侍汤药，未曾废离。\n"
        );

        myPlen.add(myPlay[0]);
        myPlay[1]=new MyPlan();
        myPlay[1].setMyplan(
                "\b\b\b\b逮奉圣朝，沐浴清化。前太守臣逵察臣孝廉，后刺史臣荣举臣秀才。" +
                        "臣以供养无主，辞不赴命。诏书特下，拜臣郎中，寻蒙国恩，除臣洗马。" +
                        "猥以微贱，当侍东宫，非臣陨首所能上报。臣具以表闻，辞不就职。诏书切峻，责臣逋慢。" +
                        "郡县逼迫，催臣上道；" +
                        "州司临门，急于星火。臣欲奉诏奔驰，则刘病日笃；" +
                        "欲苟顺私情，则告诉不许：臣之进退，实为狼狈。\n"
        );
        myPlen.add(myPlay[1]);
        myPlay[2]=new MyPlan();
        myPlay[2].setMyplan(
                "\b\b\b\b伏惟圣朝以孝治天下，凡在故老，犹蒙矜育，况臣孤苦，特为尤甚。" +
                        "且臣少仕伪朝，历职郎署，本图宦达，不矜名节。" +
                        "今臣亡国贱俘，至微至陋，过蒙拔擢，宠命优渥，岂敢盘桓，有所希冀" +
                        "。但以刘日薄西山，气息奄奄，人命危浅，朝不虑夕。" +
                        "臣无祖母，无以至今日；祖母无臣，无以终余年。母、孙二人，更相为命，" +
                        "是以区区不能废远。\n"
        );
        myPlen.add(myPlay[2]);
        myPlay[3]=new MyPlan();
        myPlay[3].setMyplan(
                "\b\b\b\b臣密今年四十有四，祖母刘今年九十有六，是臣尽节于陛下之日长，" +
                        "报养刘之日短也。乌鸟私情，愿乞终养。" +
                        "臣之辛苦，非独蜀之人士及二州牧伯所见明知，皇天后土，实所共鉴。" +
                        "愿陛下矜悯愚诚，听臣微志，庶刘侥幸，保卒余年。臣生当陨首，死当结草。" +
                        "臣不胜犬马怖惧之情，谨拜表以闻。\n");
        myPlen.add(myPlay[3]);
    }
    public void initEPGF(List<MyPlan> myPlen)
    {
        myPlen.clear();//每初始化一个碎片清空
        MyPlan[] myPlay=new MyPlan[10];//循环的个数
        myPlay[0]=new MyPlan();
        myPlay[0].setMyplan("\n" +"阿房宫赋\b\b唐\b\b杜牧\n\n\b\b\b\b"+
                "六王毕，四海一；蜀山兀，阿房出。覆压三百余里，隔离天日。" +
                "骊山北构而西折，直走咸阳。二川溶溶，流入宫墙。五步一楼，十步一阁；" +
                "廊腰缦回，檐牙高啄；各抱地势，钩心斗角。盘盘焉，囷囷焉，蜂房水涡，矗不知乎几千万落！" +
                "长桥卧波，未云何龙？複道行空，不霁何虹？高低冥迷，不知西东。" +
                "歌台暖响，春光融融；舞殿冷袖，风雨凄凄。一日之内，一宫之间，而气候不齐。\n"
        );
        myPlen.add(myPlay[0]);
        myPlay[1]=new MyPlan();
        myPlay[1].setMyplan(
                "\b\b\b\b妃嫔媵嫱，王子皇孙，辞楼下殿，辇来于秦，朝歌夜弦，为秦宫人。" +
                        "明星荧荧，开妆镜也；绿云扰扰，梳晓鬟也；渭流涨腻，弃脂水也；烟斜雾横，焚椒兰也。" +
                        "雷霆乍惊，宫车过也；" +
                        "辘辘远听，杳不知其所之也。一肌一容，尽态极妍，" +
                        "缦立远视，而望幸焉；有不得见者，三十六年。\n");
        myPlen.add(myPlay[1]);
        myPlay[2]=new MyPlan();
        myPlay[2].setMyplan(
                "\b\b\b\b燕、赵之收藏，韩、魏之经营，齐、楚之精英，几世几年，摽掠其人，倚叠如山。" +
                        "一旦不能有，输来其间。鼎铛玉石，金块珠砾，弃掷逦迤，秦人视之，亦不甚惜。\n"
        );
        myPlen.add(myPlay[2]);
        myPlay[3]=new MyPlan();
        myPlay[3].setMyplan(
                "\b\b\b\b嗟乎！一人之心，千万人之心也。秦爱纷奢，人亦念其家；奈何取之尽锱铢，用之如泥沙？" +
                        "使负栋之柱，多于南亩之农夫；架梁之椽，多于机上之工女；" +
                        "钉头磷磷，多于在庾之粟粒；瓦缝参差，多于周身之帛缕；直栏横槛，多于九土之城郭；" +
                        "管弦呕哑，多于市人之言语。" +
                        "使天下之人，不敢言而敢怒；独夫之心，日益骄固。戍卒叫，函谷举；楚人一炬，可怜焦土。\n");

        myPlen.add(myPlay[3]);
        myPlay[4]=new MyPlan();
        myPlay[4].setMyplan(
                "\b\b\b\b呜呼！灭六国者，六国也，非秦也。族秦者，秦也，非天下也。嗟乎！" +
                        "使六国各爱其人，则足以拒秦；使秦复爱六国之人，则递三世可至万世而为君，谁得而族灭也？" +
                        "秦人不暇自哀，而后人哀之；后人哀之而不鉴之，亦使后人而复哀后人也。\n"
        );
        myPlen.add(myPlay[4]);
    }
    public void initXJXZ(List<MyPlan> myPlen)
    {
        myPlen.clear();//每初始化一个碎片清空
        MyPlan[] myPlay=new MyPlan[10];//循环的个数
        myPlay[0]=new MyPlan();
        myPlay[0].setMyplan("\n" +"项脊轩志\b\b明\b\b归有光\n\n\b\b\b\b"+
                "项脊轩，旧南阁子也。室仅方丈，可容一人居。" +
                "百年老屋，尘泥渗漉，雨泽下注；每移案，顾视，无可置者。" +
                "又北向，不能得日，日过午已昏。余稍为修葺，使不上漏。" +
                "前辟四窗，垣墙周庭，以当南日，日影反照，室始洞然。" +
                "又杂植兰桂竹木于庭，旧时栏楯，亦遂增胜。借书满架，偃仰啸歌，冥然兀坐，万籁有声；" +
                "而庭堦寂寂，小鸟时来啄食，人至不去。三五之夜，明月半墙，" +
                "桂影斑驳，风移影动，珊珊可爱。\n"
        );

        myPlen.add(myPlay[0]);
        myPlay[1]=new MyPlan();
        myPlay[1].setMyplan(
                "\b\b\b\b然余居于此，多可喜，亦多可悲。先是庭中通南北为一。迨诸父异爨，内外多置小门，墙往往而是。" +
                        "东犬西吠，客逾庖而宴，鸡栖于厅。庭中始为篱，已为墙，凡再变矣。家有老妪，尝居于此。" +
                        "妪，先大母婢也，乳二世，先妣抚之甚厚。室西连于中闺，先妣尝一至。妪每谓余曰：”某所，" +
                        "而母立于兹。”妪又曰：”汝姊在吾怀，呱呱而泣；娘以指叩门扉曰：‘儿寒乎？欲食乎？’" +
                        "吾从板外相为应答。”语未毕，余泣，妪亦泣。余自束发，读书轩中，一日，大母过余曰：”吾儿，" +
                        "久不见若影，何竟日默默在此，大类女郎也？”比去，以手阖门，自语曰：”吾家读书久不效，" +
                        "儿之成，则可待乎！”顷之，持一象笏至，曰：”此吾祖太常公宣德间执此以朝，他日汝当用之！”" +
                        "瞻顾遗迹，如在昨日，令人长号不自禁。\n"
        );

        myPlen.add(myPlay[1]);
        myPlay[2]=new MyPlan();
        myPlay[2].setMyplan(
                "\b\b\b\b轩东，故尝为厨，人往，从轩前过。" +
                        "余扃牖而居，久之，能以足音辨人。" +
                        "轩凡四遭火，得不焚，殆有神护者。\n"
        );
        myPlen.add(myPlay[2]);
        myPlay[3]=new MyPlan();
        myPlay[3].setMyplan(
                "\b\b\b\b项脊生曰：”蜀清守丹穴，利甲天下，其后秦皇帝筑女怀清台；" +
                        "刘玄德与曹操争天下，诸葛孔明起陇中。方二人之昧昧于一隅也，世何足以知之" +
                        "，余区区处败屋中，方扬眉、瞬目，谓有奇景。人知之者，其谓与坎井之蛙何异？”\n");

        myPlen.add(myPlay[3]);
        myPlay[4]=new MyPlan();
        myPlay[4].setMyplan(
                "\b\b\b\b余既为此志，后五年，吾妻来归，时至轩中，从余问古事，或凭几学书。" +
                        "吾妻归宁，述诸小妹语曰：”闻姊家有阁子，且何谓阁子也？”其后六年，吾妻死，室坏不修。" +
                        "其后二年，余久卧病无聊，乃使人复葺南阁子，其制稍异于前。" +
                        "然自后余多在外，不常居。\n"
        );

        myPlen.add(myPlay[4]);
        myPlay[5]=new MyPlan();
        myPlay[5].setMyplan(
                "\b\b\b\b庭有枇杷树，吾妻死之年所手植也，今已亭亭如盖矣。\n"
        );
        myPlen.add(myPlay[5]);
    }
}
